INSERT INTO "Page" ("parentId", "title", "name", "slug" ) VALUES
  (1, 'Главная', 'main', 'glavnaia'),
  (1, 'О нас', 'about', 'o-nas'),
  (1, 'Новости', 'news', 'novosti'),
  (1, 'Помочь', 'helpGive', 'pomoch'),
  (1, 'Получить помощь', 'helpGet', 'poluchit-pomosh'),
  (1, 'Контaкты', 'contact', 'kontakti');

-- INSERT INTO "Page" ("parentId", "title", "name", "slug" ) VALUES
--  (3, 'Первая новость', 'news_1', 'pervaia-novost'),
--  (3, 'Вторая новость', 'news_2', 'vrtoraia-novost'),
--  (3, 'Третья новость', 'news_3', 'tretia-novost');

INSERT INTO "Meta" ("title", "description", "keywords", "pageId" ) VALUES
  ('Главная страница', 'Описание главной страницы', 'Благотворительный фонд, УкрХумБат, Ukrhumbat', 1),
  ('Страница о нашем проекте', 'Описание страницы о проекте', 'Благотворительный фонд, УкрХумБат, Ukrhumbat', 2),
  ('Страница норвостей', 'Описание страницы с новостями', 'Благотворительный фонд, УкрХумБат, Ukrhumbat', 3),
  ('Страница получения помощи', 'Описание страницы для получения помощи', 'Благотворительный фонд, УкрХумБат, Ukrhumbat', 4),
  ('Страница донатов', 'Описание страницы для пожертвований', 'Благотворительный фонд, УкрХумБат, Ukrhumbat', 5),
  ('Страница контактов', 'Описание страницы контактов', 'Благотворительный фонд, УкрХумБат, Ukrhumbat', 6);

-- INSERT INTO "Meta" ("title", "description", "keywords", "pageId" ) VALUES
--  ('Страница с первой новостью', 'Описание первой новости', 'Благотворительный фонд, УкрХумБат, Ukrhumbat', 7),
--  ('Страница со вторйо новостью', 'Описание второй новости', 'Благотворительный фонд, УкрХумБат, Ukrhumbat', 8),
--  ('Страница с третьей новость', 'Описание третей новости', 'Благотворительный фонд, УкрХумБат, Ukrhumbat', 9);

INSERT INTO "News" ("title", "titleSecondary", "text", "textSecondary", "img", "video", "published") VALUES
  ('Первая новость', 'Второй заголовок новости', 'Текст для статьи', 'Второй текст для статьи', '{"path":["/path/to/img.jpg"]}', 'https://youtu.be/jeQOYnhS90U', true),
  ('Вторая новость', 'Второй заголовок новости', 'Текст для статьи', 'Второй текст для статьи', '{"path":["/path/to/img.jpg"]}', 'https://youtu.be/jeQOYnhS90U', true),
  ('Третья новость', 'Второй заголовок новости', 'Текст для статьи', 'Второй текст для статьи', '{"path":["/path/to/img.jpg"]}', 'https://youtu.be/jeQOYnhS90U', true);


INSERT INTO "Result" ("name", "title", "text") VALUES
  ('a', '56', 'Тепловизоры и прицелы для ЗСУ'),
  ('b', '500 Тонн', 'Гумпомощи та медикаментов'),
  ('c', '120', 'Автомобили и другой транспорт'),
  ('d', '64', 'Дроны для разведнки на поле боя');


INSERT INTO "Social" ("name", "key", "link") VALUES
  ('facebook', 'fb', 'https://www.facebook.com/profile.php?id=100085936770532'),
  ('instagram', 'insta', 'https://www.instagram.com/ukrhumbat/?igshid=YmMyMTA2M2Y%3D');

INSERT INTO "Support" ("name", "key", "title", "text") VALUES
  ('a', 'medcikal', 'Медикаменты', 'Медицини та здоров''я - медикаменти та все, що пов''язано зі здоров''ям та рятуванням наших захисників'),
  ('b', 'transport', 'Транспорт', 'Транспорт і засоби переміщення - авто для Сил оборони, включаючи ремонт та обслуговування'),
  ('c', 'intelligence', 'Розведка', 'Засоби розвідки - тепловізори, дрони, приціли і інші необхідні речі'),
  ('d', 'common', 'Общая поддержка', 'Загальна підтримка необхідним - продовольча підтримка, предмети одягу, засоби гігієни');


INSERT INTO "Team" ("firstName", "lastName", "middleName", "position", "bio", "img") VALUES
  ('МАКСИМ', 'ЖУРАВЛЬОВ', '', 'Голова та співзасновник Фонду', 'Голова наглядової ради, волонтер фонду, адвокат, громадський діяч, м. Харків', '{"path":["/path/to/img.jpg"]}' ),
  ('ІЛЛЯ', 'ЛУНІН', '','Співзасновник Фонду','Член наглядової ради, волонтер фонду, підприємець в сфері продовольчого бізнесу, м. Харків', '{"path":["/path/to/img.jpg"]}' ),
  ('СТАНІСЛАВ', 'ЗУМСЬКОЙ', '','Співзасновник Фонду','Член наглядової ради, волонтер фонду, підприємець в сфері будівельного бізнесу, м. Харків', '{"path":["/path/to/img.jpg"]}' ),
  ('ВІТАЛІЙ', 'ДОЦЕНКО', '','Співзасновник Фонду', 'Член наглядової ради, волонтер фонду, підприємець в сфері енергетичного бізнесу та виробництва, м. Харків','{"path":["/path/to/img.jpg"]}' );
